# GetModelGUID Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelPath..::..GetModelGUID Method
ModelPath Class See Also
---
A GUID identifying the Revit cloud model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Guid GetModelGUID()
```

Visual Basic
---
```text
Public Function GetModelGUID As Guid
```

Visual C++
---
```text
public:
Guid GetModelGUID()
```

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace